20250211T222136--kdoc-336-『how-does-a-usb-keyboard-work』__book.org
:properties:
:ID: 20250211T222136
:mtime:    20250217224920
:ctime:    20250211222140
:end:
#+title:      KDOC 336: 『How does a USB keyboard work?』
#+date:       [2025-02-11 Tue 22:21]
#+filetags:   :book:
#+identifier: 20250211T222136

* この文書のステータス
- 作成
  - [X] 2025-02-15 貴島
- レビュー
  - [X] 2025-02-17 貴島

* 概要
USBのプロトコルを解説する動画を見た。

#+begin_export html
<iframe width="560" height="315" src="https://www.youtube.com/embed/wdgULBpRoXk?si=w0x2246H6dJtaElq" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>
#+end_export

* メモ

- 実際のデータをもとに、手で波形の変化をバイト列に直し、USBの仕様書と比較して解説していくのが興味深い
- 英語があまりわからなくても1つずつ絵とともに進むので直感的にわかる。細かいことは全体わかってないが、全体像を把握できる。30分で親しみと興味を喚起するのは偉大なことである
- 高級キーボードにあるようなNキー打鍵の違いがわかる
- キー用のオシロスコープがある
- USBキーボードとPS/2キーボードの違いがわかる
  - 波形
  - 転送量
  - 応答速度
  - 変換方法

* 関連
- [[id:20250209T192915][KDOC 333: 動画にシフトしている分野がある]]。素晴らしい動画コンテンツに感銘を受けたつながり
