20250211T222136--kdoc-336-『how-does-a-usb-keyboard-work』__book.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-27T23:06:09Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 336: 『How does a USB keyboard work?』</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 336: 『How does a USB keyboard work?』</h1>
<div id="outline-container-orgfaacd87" class="outline-2">
<h2 id="orgfaacd87"><a href="#orgfaacd87">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgfaacd87">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-02-15 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-02-17 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org9c3f629" class="outline-2">
<h2 id="org9c3f629"><a href="#org9c3f629">概要</a></h2>
<div class="outline-text-2" id="text-org9c3f629">
<p>
USBのプロトコルを解説する動画を見た。
</p>

<iframe width="560" height="315" src="https://www.youtube.com/embed/wdgULBpRoXk?si=w0x2246H6dJtaElq" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>
</div>
</div>
<div id="outline-container-org8965af1" class="outline-2">
<h2 id="org8965af1"><a href="#org8965af1">メモ</a></h2>
<div class="outline-text-2" id="text-org8965af1">
<ul class="org-ul">
<li>実際のデータをもとに、手で波形の変化をバイト列に直し、USBの仕様書と比較して解説していくのが興味深い</li>
<li>英語があまりわからなくても1つずつ絵とともに進むので直感的にわかる。細かいことは全体わかってないが、全体像を把握できる。30分で親しみと興味を喚起するのは偉大なことである</li>
<li>高級キーボードにあるようなNキー打鍵の違いがわかる</li>
<li>キー用のオシロスコープがある</li>
<li>USBキーボードとPS/2キーボードの違いがわかる
<ul class="org-ul">
<li>波形</li>
<li>転送量</li>
<li>応答速度</li>
<li>変換方法</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3ac3286" class="outline-2">
<h2 id="org3ac3286"><a href="#org3ac3286">関連</a></h2>
<div class="outline-text-2" id="text-org3ac3286">
<ul class="org-ul">
<li><a href="20250209T192915--kdoc-333-動画にシフトしている分野がある__essay.html#ID-20250209T192915">KDOC 333: 動画にシフトしている分野がある</a>。素晴らしい動画コンテンツに感銘を受けたつながり</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
